from colorist import ColorHex
orange = ColorHex("#ffc83d")

def clear():
    print(f"""{orange}                     
           3ÏÏÏÏ3ÏÏ           
         ÏÏÏÏÏÏÏÌÌÌÏÏ         
        3ÏÌÏÏÏÏÏÏÌÏÏÏÏ        
        ÏÌÌÌÌÌÌÌÏÏÏÏÌÏ3       
        ÏÏÏÏÌÌÏÏÏÌÌÏÏÏÌ       
        ÏÏÏÌÏÏÏÏÏÌÏÏÏÏ        
         ÏÌÌÏÌÏÏÌÏÏÏÌ±        
           Ì3ÏÏÏÏÏÏ3          
                              {orange.OFF}""")

def fclouds():
    print(f"""{orange}          
                  óóL         
           …’˜¨LÏÏÏÌÏÏÌÏ      
         ˜˜˜˜˜˜’CÏÌÏÏÌÏÏÏ     
         ˜˜˜˜˜˜˜‘’’‹ÌÏÌÏÏ     
      ’˜˜˜˜˜˜˜˜˜˜˜˜˜j±ÏÏÏ     
     ˆ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜ˆ>      
     ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜      
       ˆ˜˜ˆ˜˜˜˜˜ˆ˜˜ˆ˜˜‚       
                              {orange.OFF}""")

def sclouds():
    print(f"""{orange}         
           ˆ˜˜˜ˆ              
          ˜˜˜˜˜˜˜˜            
        …˜¸˜˜˜˜˜˜˜˜˜˜         
      ˆ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜’      
      ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜      
       ˆ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜ˆ      
                              {orange.OFF}""")

def bclouds():
    print(f"""{orange}      
                ýý            
           ˆ‘ ÙÖÖÖÖè          
         ˜˜˜˜’‚üÞÖÞÖÖÞÞ       
        ˆ˜˜˜˜˜˜››’!dÖÖÖÞè     
     ‘’˜˜˜˜˜˜˜˜˜˜˜˜×dÞÞÞÖè    
     ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜‚§ÖÓ     
     ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜’       
      ’˜˜˜˜˜˜˜˜˜˜˜˜ˆ’¸        
                              {orange.OFF}""")


def occlouds():
    print(f"""{orange}
                ýý            
           ˆ‘ ÙÖÖÖÖè          
         ˜˜˜˜’‚üÞÖÞÖÖÞÞ       
        ˆ˜˜˜˜˜˜››’!dÖÖÖÞè     
     ‘’˜˜˜˜˜˜˜˜˜˜˜˜×dÞÞÞÖè    
     ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜‚§ÖÓ     
     ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜’       
      ’˜˜˜˜˜˜˜˜˜˜˜˜ˆ’¸        
                           {orange.OFF}""")

def srain():
    print(f"""{orange}      
              ÓÞÖÖÞ           
         ‚˜˜˜’°šÞÖÞÖÞè        
         ’˜˜˜˜˜‘’;4ÞÞÞÞý      
      ˜˜˜˜˜˜˜˜˜˜˜˜‘³PÖÞÓ      
      ˜˜˜˜˜˜˜˜˜˜˜˜˜˜˜         
        ˜’´D¨˜’¸¸’’˜          
          ÓèÓÓ è              
            Ó ÞÞ              
                              {orange.OFF}""")

def rain():
    print(f"""{orange}     
             ’ ÏÏÏÌÏÌÏ        
          ˜ˆ˜˜˜^±ÌÏÏÏÏÏ       
         ˜˜˜˜˜˜˜‚˜–ÍÏÏÏ       
       ˆ˜˜˜˜˜˜˜˜˜˜˜‘¦V3       
       ˆ˜˜˜˜˜˜˜˜˜˜˜˜˜’        
        ´˜˜±4˜’˜‚ˆ˜˜˜         
           Þ Öè Þ             
            èÓ Þ              
                              {orange.OFF}""")

def tstorm():
    print(f"""{orange}       
                Ùd            
           ˜˜`èÖÞÖÖÖ          
         ˆ˜˜˜’‹§ÞÖÞÞÖÞÞ       
        ’˜˜˜˜˜˜:;;vÞÖÖÞÖÓ     
     ˆ˜˜˜˜˜˜˜˜˜˜˜˜;äÙÞÞÞÞ     
     ˜˜˜˜˜˜’’˜˜˜˜˜˜˜˜°å$      
     ˆ˜˜˜˜?L×˜˜˜˜˜˜˜˜˜        
         ±3Ï3                 
         LÏ±                  
                              {orange.OFF}""")

def snow():
    print(f"""{orange}
                     ⣠⡀⢸⡆⡀⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢶⠄⠘⢺⡺⣺⠺⠁⢰⡲⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⠵⡵⣳⠀⠀⡪⡗⠀⠀⣺⣪⢞⠕⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠮⠞⠝⠑⢯⡺⡊⠫⣳⠝⠕⠙⠕⠷⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⡦⡤⣠⣀⢴⣫⢄⣠⣺⢕⡄⣠⢄⡦⡂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣨⢮⡳⡳⠁⠈⢹⡪⠀⠁⢯⢗⡧⣅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⡾⡑⢀⢴⢽⢵⣢⡀⠸⡵⠈⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠝⠁⢝⡕⠘⠪⠀⠀⠀⠀                           
                                                            {orange.OFF}""")

def mist():
    print(f"""{orange}                       
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⣀⢀⡀⣀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠈⠉⠉⠁⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠓⠓⠓⠓⠙⠊⠛⠑⠋⠋⠋⠋⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠴⠦⠶⠴⠦⠶⠴⠦⠶⠴⠴⠴⠤⠦⠦⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣤⣠⢤⣄⡤⣤⣄⡤⣤⣠⢤⣄⡤⣤⣠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠈⠉⠈⠉⠈⠉⠈⠉⠈⠉⠈⠉⠈⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠙⠙⠙⠙⠙⠙⠙⠙⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀                      
                                                            {orange.OFF}""")
